M0LTE/pi-transceiver/electronics/PA_Board_V2/Arduino/Board/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug

# -----------------------------------
# Adafruit Feather M0 (SAMD21)
# -----------------------------------
adafruit_feather_m0.name=Adafruit Feather M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_feather_m0.vid.0=0x239A
adafruit_feather_m0.pid.0=0x800B
adafruit_feather_m0.vid.1=0x239A
adafruit_feather_m0.pid.1=0x000B
adafruit_feather_m0.vid.2=0x239A
adafruit_feather_m0.pid.2=0x0015

# Upload
adafruit_feather_m0.upload.tool=bossac18
adafruit_feather_m0.upload.protocol=sam-ba
adafruit_feather_m0.upload.maximum_size=262144
adafruit_feather_m0.upload.offset=0x2000
adafruit_feather_m0.upload.use_1200bps_touch=true
adafruit_feather_m0.upload.wait_for_upload_port=true
adafruit_feather_m0.upload.native_usb=true

# Build
adafruit_feather_m0.build.mcu=cortex-m0plus
adafruit_feather_m0.build.f_cpu=48000000L
adafruit_feather_m0.build.usb_product="Feather M0"
adafruit_feather_m0.build.usb_manufacturer="Adafruit"
adafruit_feather_m0.build.board=SAMD_ZERO
adafruit_feather_m0.build.core=arduino
adafruit_feather_m0.build.extra_flags=-D__SAMD21G18A__ -DADAFRUIT_FEATHER_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_feather_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_feather_m0.build.openocdscript=openocd_scripts/feather_m0.cfg
adafruit_feather_m0.build.variant=feather_m0
adafruit_feather_m0.build.variant_system_lib=
adafruit_feather_m0.build.vid=0x239A
adafruit_feather_m0.build.pid=0x800B
adafruit_feather_m0.bootloader.tool=openocd
adafruit_feather_m0.bootloader.file=featherM0/bootloader-feather_m0-v2.0.0-adafruit.5.bin

# Menu
adafruit_feather_m0.menu.opt.small=Small (-Os) (standard)
adafruit_feather_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_feather_m0.menu.opt.fast=Fast (-O2)
adafruit_feather_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_feather_m0.menu.opt.faster=Faster (-O3)
adafruit_feather_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_feather_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_feather_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_feather_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_feather_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_feather_m0.menu.usbstack.arduino=Arduino
adafruit_feather_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_feather_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_feather_m0.menu.debug.off=Off
adafruit_feather_m0.menu.debug.on=On
adafruit_feather_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Feather M0 Express (SAMD21)
# -----------------------------------
adafruit_feather_m0_express.name=Adafruit Feather M0 Express (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_feather_m0_express.vid.0=0x239A
adafruit_feather_m0_express.pid.0=0x801B
adafruit_feather_m0_express.vid.1=0x239A
adafruit_feather_m0_express.pid.1=0x001B

# Upload
adafruit_feather_m0_express.upload.tool=bossac18
adafruit_feather_m0_express.upload.protocol=sam-ba
adafruit_feather_m0_express.upload.maximum_size=262144
adafruit_feather_m0_express.upload.offset=0x2000
adafruit_feather_m0_express.upload.use_1200bps_touch=true
adafruit_feather_m0_express.upload.wait_for_upload_port=true
adafruit_feather_m0_express.upload.native_usb=true

# Build
adafruit_feather_m0_express.build.mcu=cortex-m0plus
adafruit_feather_m0_express.build.f_cpu=48000000L
adafruit_feather_m0_express.build.usb_product="Feather M0 Express"
adafruit_feather_m0_express.build.usb_manufacturer="Adafruit"
adafruit_feather_m0_express.build.board=SAMD_FEATHER_M0_EXPRESS
adafruit_feather_m0_express.build.core=arduino
adafruit_feather_m0_express.build.extra_flags=-D__SAMD21G18A__ -DARDUINO_SAMD_FEATHER_M0 -DARDUINO_SAMD_FEATHER_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_feather_m0_express.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_feather_m0_express.build.openocdscript=openocd_scripts/feather_m0_express.cfg
adafruit_feather_m0_express.build.variant=feather_m0_express
adafruit_feather_m0_express.build.variant_system_lib=
adafruit_feather_m0_express.build.vid=0x239A
adafruit_feather_m0_express.build.pid=0x801B
adafruit_feather_m0_express.bootloader.tool=openocd
adafruit_feather_m0_express.bootloader.file=featherM0/bootloader-feather_m0-v2.0.0-adafruit.5.bin

# Menu
adafruit_feather_m0_express.menu.opt.small=Small (-Os) (standard)
adafruit_feather_m0_express.menu.opt.small.build.flags.optimize=-Os
adafruit_feather_m0_express.menu.opt.fast=Fast (-O2)
adafruit_feather_m0_express.menu.opt.fast.build.flags.optimize=-O2
adafruit_feather_m0_express.menu.opt.faster=Faster (-O3)
adafruit_feather_m0_express.menu.opt.faster.build.flags.optimize=-O3
adafruit_feather_m0_express.menu.opt.fastest=Fastest (-Ofast)
adafruit_feather_m0_express.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_feather_m0_express.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_feather_m0_express.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_feather_m0_express.menu.usbstack.arduino=Arduino
adafruit_feather_m0_express.menu.usbstack.tinyusb=TinyUSB
adafruit_feather_m0_express.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_feather_m0_express.menu.debug.off=Off
adafruit_feather_m0_express.menu.debug.on=On
adafruit_feather_m0_express.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Metro M0 Express (SAMD21)
# -----------------------------------
adafruit_metro_m0.name=Adafruit Metro M0 Express (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_metro_m0.vid.0=0x239A
adafruit_metro_m0.pid.0=0x8013
adafruit_metro_m0.vid.1=0x239A
adafruit_metro_m0.pid.1=0x0013

# Upload
adafruit_metro_m0.upload.tool=bossac18
adafruit_metro_m0.upload.protocol=sam-ba
adafruit_metro_m0.upload.maximum_size=262144
adafruit_metro_m0.upload.offset=0x2000
adafruit_metro_m0.upload.use_1200bps_touch=true
adafruit_metro_m0.upload.wait_for_upload_port=true
adafruit_metro_m0.upload.native_usb=true

# Build
adafruit_metro_m0.build.mcu=cortex-m0plus
adafruit_metro_m0.build.f_cpu=48000000L
adafruit_metro_m0.build.usb_product="Metro M0 Express"
adafruit_metro_m0.build.usb_manufacturer="Adafruit"
adafruit_metro_m0.build.board=SAMD_ZERO
adafruit_metro_m0.build.core=arduino
adafruit_metro_m0.build.extra_flags=-D__SAMD21G18A__ -DADAFRUIT_METRO_M0_EXPRESS -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_metro_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_metro_m0.build.openocdscript=openocd_scripts/metro_m0.cfg
adafruit_metro_m0.build.variant=metro_m0
adafruit_metro_m0.build.variant_system_lib=
adafruit_metro_m0.build.vid=0x239A
adafruit_metro_m0.build.pid=0x8013
adafruit_metro_m0.bootloader.tool=openocd
adafruit_metro_m0.bootloader.file=metroM0/bootloader-metro_m0-v2.0.0-adafruit.5.bin

# Menu
adafruit_metro_m0.menu.opt.small=Small (-Os) (standard)
adafruit_metro_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_metro_m0.menu.opt.fast=Fast (-O2)
adafruit_metro_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_metro_m0.menu.opt.faster=Faster (-O3)
adafruit_metro_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_metro_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_metro_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_metro_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_metro_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_metro_m0.menu.usbstack.arduino=Arduino
adafruit_metro_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_metro_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_metro_m0.menu.debug.off=Off
adafruit_metro_m0.menu.debug.on=On
adafruit_metro_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Circuit Playground Express (SAMD21)
# -----------------------------------
adafruit_circuitplayground_m0.name=Adafruit Circuit Playground Express (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_circuitplayground_m0.vid.0=0x239A
adafruit_circuitplayground_m0.pid.0=0x8018
adafruit_circuitplayground_m0.vid.1=0x239A
adafruit_circuitplayground_m0.pid.1=0x0019

# Upload
adafruit_circuitplayground_m0.upload.tool=bossac18
adafruit_circuitplayground_m0.upload.protocol=sam-ba
adafruit_circuitplayground_m0.upload.maximum_size=262144
adafruit_circuitplayground_m0.upload.offset=0x2000
adafruit_circuitplayground_m0.upload.use_1200bps_touch=true
adafruit_circuitplayground_m0.upload.wait_for_upload_port=true
adafruit_circuitplayground_m0.upload.native_usb=true

# Build
adafruit_circuitplayground_m0.build.mcu=cortex-m0plus
adafruit_circuitplayground_m0.build.f_cpu=48000000L
adafruit_circuitplayground_m0.build.usb_product="Circuit Playground Express"
adafruit_circuitplayground_m0.build.usb_manufacturer="Adafruit"
adafruit_circuitplayground_m0.build.board=SAMD_CIRCUITPLAYGROUND_EXPRESS
adafruit_circuitplayground_m0.build.core=arduino
adafruit_circuitplayground_m0.build.extra_flags=-D__SAMD21G18A__ -DCRYSTALLESS -DADAFRUIT_CIRCUITPLAYGROUND_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_circuitplayground_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_circuitplayground_m0.build.openocdscript=openocd_scripts/circuitplay.cfg
adafruit_circuitplayground_m0.build.variant=circuitplay
adafruit_circuitplayground_m0.build.variant_system_lib=
adafruit_circuitplayground_m0.build.vid=0x239A
adafruit_circuitplayground_m0.build.pid=0x8018
adafruit_circuitplayground_m0.bootloader.tool=openocd
adafruit_circuitplayground_m0.bootloader.file=circuitplayM0/bootloader-circuitplay_m0-v2.0.0-adafruit.5.bin

# Menu
adafruit_circuitplayground_m0.menu.opt.small=Small (-Os) (standard)
adafruit_circuitplayground_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_circuitplayground_m0.menu.opt.fast=Fast (-O2)
adafruit_circuitplayground_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_circuitplayground_m0.menu.opt.faster=Faster (-O3)
adafruit_circuitplayground_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_circuitplayground_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_circuitplayground_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_circuitplayground_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_circuitplayground_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_circuitplayground_m0.menu.usbstack.arduino=Arduino
adafruit_circuitplayground_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_circuitplayground_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_circuitplayground_m0.menu.debug.off=Off
adafruit_circuitplayground_m0.menu.debug.on=On
adafruit_circuitplayground_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Gemma M0 (SAMD21)
# -----------------------------------
adafruit_gemma_m0.name=Adafruit Gemma M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_gemma_m0.vid.0=0x239A
adafruit_gemma_m0.pid.0=0x801C
adafruit_gemma_m0.vid.1=0x239A
adafruit_gemma_m0.pid.1=0x001C

# Upload
adafruit_gemma_m0.upload.tool=bossac18
adafruit_gemma_m0.upload.protocol=sam-ba
adafruit_gemma_m0.upload.maximum_size=262144
adafruit_gemma_m0.upload.offset=0x2000
adafruit_gemma_m0.upload.use_1200bps_touch=true
adafruit_gemma_m0.upload.wait_for_upload_port=true
adafruit_gemma_m0.upload.native_usb=true

# Build
adafruit_gemma_m0.build.mcu=cortex-m0plus
adafruit_gemma_m0.build.f_cpu=48000000L
adafruit_gemma_m0.build.usb_product="Gemma M0"
adafruit_gemma_m0.build.usb_manufacturer="Adafruit"
adafruit_gemma_m0.build.board=GEMMA_M0
adafruit_gemma_m0.build.core=arduino
adafruit_gemma_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_GEMMA_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_gemma_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_gemma_m0.build.openocdscript=openocd_scripts/gemma_m0.cfg
adafruit_gemma_m0.build.variant=gemma_m0
adafruit_gemma_m0.build.variant_system_lib=
adafruit_gemma_m0.build.vid=0x239A
adafruit_gemma_m0.build.pid=0x801C
adafruit_gemma_m0.bootloader.tool=openocd
adafruit_gemma_m0.bootloader.file=gemmaM0/bootloader-gemma_m0-v2.0.0-adafruit.5.bin

# Menu
adafruit_gemma_m0.menu.opt.small=Small (-Os) (standard)
adafruit_gemma_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_gemma_m0.menu.opt.fast=Fast (-O2)
adafruit_gemma_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_gemma_m0.menu.opt.faster=Faster (-O3)
adafruit_gemma_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_gemma_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_gemma_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_gemma_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_gemma_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_gemma_m0.menu.usbstack.arduino=Arduino
adafruit_gemma_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_gemma_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_gemma_m0.menu.debug.off=Off
adafruit_gemma_m0.menu.debug.on=On
adafruit_gemma_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Trinket M0 (SAMD21)
# -----------------------------------
adafruit_trinket_m0.name=Adafruit Trinket M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_trinket_m0.vid.0=0x239A
adafruit_trinket_m0.pid.0=0x801E
adafruit_trinket_m0.vid.1=0x239A
adafruit_trinket_m0.pid.1=0x001E

# Upload
adafruit_trinket_m0.upload.tool=bossac18
adafruit_trinket_m0.upload.protocol=sam-ba
adafruit_trinket_m0.upload.maximum_size=262144
adafruit_trinket_m0.upload.offset=0x2000
adafruit_trinket_m0.upload.use_1200bps_touch=true
adafruit_trinket_m0.upload.wait_for_upload_port=true
adafruit_trinket_m0.upload.native_usb=true

# Build
adafruit_trinket_m0.build.mcu=cortex-m0plus
adafruit_trinket_m0.build.f_cpu=48000000L
adafruit_trinket_m0.build.usb_product="Trinket M0"
adafruit_trinket_m0.build.usb_manufacturer="Adafruit"
adafruit_trinket_m0.build.board=TRINKET_M0
adafruit_trinket_m0.build.core=arduino
adafruit_trinket_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_TRINKET_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_trinket_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_trinket_m0.build.openocdscript=openocd_scripts/trinket_m0.cfg
adafruit_trinket_m0.build.variant=trinket_m0
adafruit_trinket_m0.build.variant_system_lib=
adafruit_trinket_m0.build.vid=0x239A
adafruit_trinket_m0.build.pid=0x801E
adafruit_trinket_m0.bootloader.tool=openocd
adafruit_trinket_m0.bootloader.file=trinketm0/bootloader-trinket_m0-v2.0.0-adafruit.5.bin

# Menu
adafruit_trinket_m0.menu.opt.small=Small (-Os) (standard)
adafruit_trinket_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_trinket_m0.menu.opt.fast=Fast (-O2)
adafruit_trinket_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_trinket_m0.menu.opt.faster=Faster (-O3)
adafruit_trinket_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_trinket_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_trinket_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_trinket_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_trinket_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_trinket_m0.menu.usbstack.arduino=Arduino
adafruit_trinket_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_trinket_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_trinket_m0.menu.debug.off=Off
adafruit_trinket_m0.menu.debug.on=On
adafruit_trinket_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Pi_Tx_PA (SAMD21) 
# RADARC pi-transceiver 
# Control processor (SAMD21E18)for PA module
# -----------------------------------
Pi_Tx_PA.name=RADARC Pi_Tx_PA

# VID/PID for Bootloader, Arduino & CircuitPython
Pi_Tx_PA.vid.0=0x239A
Pi_Tx_PA.pid.0=0x801E
Pi_Tx_PA.vid.1=0x239A
Pi_Tx_PA.pid.1=0x001E

# Upload
Pi_Tx_PA.upload.tool=bossac18
Pi_Tx_PA.upload.protocol=sam-ba
Pi_Tx_PA.upload.maximum_size=262144
Pi_Tx_PA.upload.offset=0x2000
Pi_Tx_PA.upload.use_1200bps_touch=true
Pi_Tx_PA.upload.wait_for_upload_port=true
Pi_Tx_PA.upload.native_usb=true

# Build
Pi_Tx_PA.build.mcu=cortex-m0plus
Pi_Tx_PA.build.f_cpu=48000000L
Pi_Tx_PA.build.usb_product="Pi_Tx_PA"
Pi_Tx_PA.build.usb_manufacturer="RADARC"
Pi_Tx_PA.build.board=Pi_Tx_PA
Pi_Tx_PA.build.core=arduino
Pi_Tx_PA.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_TRINKET_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
Pi_Tx_PA.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
Pi_Tx_PA.build.openocdscript=openocd_scripts/trinket_m0.cfg
Pi_Tx_PA.build.variant=Pi_Tx_PA
Pi_Tx_PA.build.variant_system_lib=
Pi_Tx_PA.build.vid=0x239A
Pi_Tx_PA.build.pid=0x801E
Pi_Tx_PA.bootloader.tool=openocd
Pi_Tx_PA.bootloader.file=trinketm0/bootloader-trinket_m0-v2.0.0-adafruit.5.bin

