M0LTE/pi-transceiver/electronics/PA_Board_V2/Arduino/Board/boards.txt
# Menu
Pi_Tx_PA.menu.opt.small=Small (-Os) (standard)
Pi_Tx_PA.menu.opt.small.build.flags.optimize=-Os
Pi_Tx_PA.menu.opt.fast=Fast (-O2)
Pi_Tx_PA.menu.opt.fast.build.flags.optimize=-O2
Pi_Tx_PA.menu.opt.faster=Faster (-O3)
Pi_Tx_PA.menu.opt.faster.build.flags.optimize=-O3
Pi_Tx_PA.menu.opt.fastest=Fastest (-Ofast)
Pi_Tx_PA.menu.opt.fastest.build.flags.optimize=-Ofast
Pi_Tx_PA.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
Pi_Tx_PA.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
Pi_Tx_PA.menu.usbstack.arduino=Arduino
Pi_Tx_PA.menu.usbstack.tinyusb=TinyUSB
Pi_Tx_PA.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
Pi_Tx_PA.menu.debug.off=Off
Pi_Tx_PA.menu.debug.on=On
Pi_Tx_PA.menu.debug.on.build.flags.debug=-g

# -----------------------------------
# Pi_Tx_PA_V2 (SAMD21) 
# RADARC pi-transceiver PA Board Version 2
# Control processor (SAMD21E18)for PA module
# -----------------------------------
Pi_Tx_PA_V2.name=RADARC Pi_Tx_PA_V2

# VID/PID for Bootloader, Arduino & CircuitPython
Pi_Tx_PA_V2.vid.0=0x239A
Pi_Tx_PA_V2.pid.0=0x801E
Pi_Tx_PA_V2.vid.1=0x239A
Pi_Tx_PA_V2.pid.1=0x001E

# Upload
Pi_Tx_PA_V2.upload.tool=bossac18
Pi_Tx_PA_V2.upload.protocol=sam-ba
Pi_Tx_PA_V2.upload.maximum_size=262144
Pi_Tx_PA_V2.upload.offset=0x2000
Pi_Tx_PA_V2.upload.use_1200bps_touch=true
Pi_Tx_PA_V2.upload.wait_for_upload_port=true
Pi_Tx_PA_V2.upload.native_usb=true

# Build
Pi_Tx_PA_V2.build.mcu=cortex-m0plus
Pi_Tx_PA_V2.build.f_cpu=48000000L
Pi_Tx_PA_V2.build.usb_product="Pi_Tx_PA_V2"
Pi_Tx_PA_V2.build.usb_manufacturer="RADARC"
Pi_Tx_PA_V2.build.board=Pi_Tx_PA_V2
Pi_Tx_PA_V2.build.core=arduino
Pi_Tx_PA_V2.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_TRINKET_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
Pi_Tx_PA_V2.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
Pi_Tx_PA_V2.build.openocdscript=openocd_scripts/trinket_m0.cfg
Pi_Tx_PA_V2.build.variant=Pi_Tx_PA_V2
Pi_Tx_PA_V2.build.variant_system_lib=
Pi_Tx_PA_V2.build.vid=0x239A
Pi_Tx_PA_V2.build.pid=0x801E
Pi_Tx_PA_V2.bootloader.tool=openocd
Pi_Tx_PA_V2.bootloader.file=trinketm0/bootloader-trinket_m0-v2.0.0-adafruit.5.bin

# Menu
Pi_Tx_PA_V2.menu.opt.small=Small (-Os) (standard)
Pi_Tx_PA_V2.menu.opt.small.build.flags.optimize=-Os
Pi_Tx_PA_V2.menu.opt.fast=Fast (-O2)
Pi_Tx_PA_V2.menu.opt.fast.build.flags.optimize=-O2
Pi_Tx_PA_V2.menu.opt.faster=Faster (-O3)
Pi_Tx_PA_V2.menu.opt.faster.build.flags.optimize=-O3
Pi_Tx_PA_V2.menu.opt.fastest=Fastest (-Ofast)
Pi_Tx_PA_V2.menu.opt.fastest.build.flags.optimize=-Ofast
Pi_Tx_PA_V2.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
Pi_Tx_PA_V2.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
Pi_Tx_PA_V2.menu.usbstack.arduino=Arduino
Pi_Tx_PA_V2.menu.usbstack.tinyusb=TinyUSB
Pi_Tx_PA_V2.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
Pi_Tx_PA_V2.menu.debug.off=Off
Pi_Tx_PA_V2.menu.debug.on=On
Pi_Tx_PA_V2.menu.debug.on.build.flags.debug=-g





# -----------------------------------
# Adafruit QT Py M0 (SAMD21)
# -----------------------------------
adafruit_qtpy_m0.name=Adafruit QT Py M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_qtpy_m0.vid.0=0x239A
adafruit_qtpy_m0.pid.0=0x80CB
adafruit_qtpy_m0.vid.1=0x239A
adafruit_qtpy_m0.pid.1=0x00CB
adafruit_qtpy_m0.vid.2=0x239A
adafruit_qtpy_m0.pid.2=0x00CC

# Upload
adafruit_qtpy_m0.upload.tool=bossac18
adafruit_qtpy_m0.upload.protocol=sam-ba
adafruit_qtpy_m0.upload.maximum_size=262144
adafruit_qtpy_m0.upload.offset=0x2000
adafruit_qtpy_m0.upload.use_1200bps_touch=true
adafruit_qtpy_m0.upload.wait_for_upload_port=true
adafruit_qtpy_m0.upload.native_usb=true

# Build
adafruit_qtpy_m0.build.mcu=cortex-m0plus
adafruit_qtpy_m0.build.f_cpu=48000000L
adafruit_qtpy_m0.build.usb_product="QT Py M0"
adafruit_qtpy_m0.build.usb_manufacturer="Adafruit"
adafruit_qtpy_m0.build.board=QTPY_M0
adafruit_qtpy_m0.build.core=arduino
adafruit_qtpy_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_QTPY_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_qtpy_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_qtpy_m0.build.openocdscript=openocd_scripts/qtpy_m0.cfg
adafruit_qtpy_m0.build.variant=qtpy_m0
adafruit_qtpy_m0.build.variant_system_lib=
adafruit_qtpy_m0.build.vid=0x239A
adafruit_qtpy_m0.build.pid=0x80CB
adafruit_qtpy_m0.bootloader.tool=openocd
adafruit_qtpy_m0.bootloader.file=qtpyM0/bootloader-qtpy_m0.bin

# Menu
adafruit_qtpy_m0.menu.opt.small=Small (-Os) (standard)
adafruit_qtpy_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_qtpy_m0.menu.opt.fast=Fast (-O2)
adafruit_qtpy_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_qtpy_m0.menu.opt.faster=Faster (-O3)
adafruit_qtpy_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_qtpy_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_qtpy_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_qtpy_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_qtpy_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_qtpy_m0.menu.usbstack.arduino=Arduino
adafruit_qtpy_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_qtpy_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_qtpy_m0.menu.debug.off=Off
adafruit_qtpy_m0.menu.debug.on=On
adafruit_qtpy_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit NeoPixel Trinkey M0 (SAMD21)
# -----------------------------------
adafruit_neotrinkey_m0.name=Adafruit NeoPixel Trinkey M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_neotrinkey_m0.vid.0=0x239A
adafruit_neotrinkey_m0.pid.0=0x80EF
adafruit_neotrinkey_m0.vid.1=0x239A
adafruit_neotrinkey_m0.pid.1=0x00EF
adafruit_neotrinkey_m0.vid.2=0x239A
adafruit_neotrinkey_m0.pid.2=0x80F0

# Upload
adafruit_neotrinkey_m0.upload.tool=bossac18
adafruit_neotrinkey_m0.upload.protocol=sam-ba
adafruit_neotrinkey_m0.upload.maximum_size=262144
adafruit_neotrinkey_m0.upload.offset=0x2000
adafruit_neotrinkey_m0.upload.use_1200bps_touch=true
adafruit_neotrinkey_m0.upload.wait_for_upload_port=true
adafruit_neotrinkey_m0.upload.native_usb=true

# Build
adafruit_neotrinkey_m0.build.mcu=cortex-m0plus
adafruit_neotrinkey_m0.build.f_cpu=48000000L
adafruit_neotrinkey_m0.build.usb_product="NeoPixel Trinkey M0"
adafruit_neotrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_neotrinkey_m0.build.board=NEOTRINKEY_M0
adafruit_neotrinkey_m0.build.core=arduino
adafruit_neotrinkey_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_NEOTRINKEY_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_neotrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_neotrinkey_m0.build.openocdscript=openocd_scripts/neotrinkey_m0.cfg
adafruit_neotrinkey_m0.build.variant=neotrinkey_m0
adafruit_neotrinkey_m0.build.variant_system_lib=
adafruit_neotrinkey_m0.build.vid=0x239A
adafruit_neotrinkey_m0.build.pid=0x80EF
adafruit_neotrinkey_m0.bootloader.tool=openocd
adafruit_neotrinkey_m0.bootloader.file=neotrinkey_m0/bootloader-neotrinkey_m0.bin

# Menu
adafruit_neotrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_neotrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_neotrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_neotrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_neotrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_neotrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_neotrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_neotrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_neotrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_neotrinkey_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_neotrinkey_m0.menu.usbstack.arduino=Arduino
adafruit_neotrinkey_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_neotrinkey_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_neotrinkey_m0.menu.debug.off=Off
adafruit_neotrinkey_m0.menu.debug.on=On
adafruit_neotrinkey_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Rotary Trinkey M0 (SAMD21)
# -----------------------------------
adafruit_rotarytrinkey_m0.name=Adafruit Rotary Trinkey M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_rotarytrinkey_m0.vid.0=0x239A
adafruit_rotarytrinkey_m0.pid.0=0x80FB
adafruit_rotarytrinkey_m0.vid.1=0x239A
adafruit_rotarytrinkey_m0.pid.1=0x00FB
adafruit_rotarytrinkey_m0.vid.2=0x239A
adafruit_rotarytrinkey_m0.pid.2=0x80FC

# Upload
adafruit_rotarytrinkey_m0.upload.tool=bossac18
adafruit_rotarytrinkey_m0.upload.protocol=sam-ba
adafruit_rotarytrinkey_m0.upload.maximum_size=262144
adafruit_rotarytrinkey_m0.upload.offset=0x2000
adafruit_rotarytrinkey_m0.upload.use_1200bps_touch=true
adafruit_rotarytrinkey_m0.upload.wait_for_upload_port=true
adafruit_rotarytrinkey_m0.upload.native_usb=true

# Build
adafruit_rotarytrinkey_m0.build.mcu=cortex-m0plus
adafruit_rotarytrinkey_m0.build.f_cpu=48000000L
adafruit_rotarytrinkey_m0.build.usb_product="Rotary Trinkey M0"
adafruit_rotarytrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_rotarytrinkey_m0.build.board=ROTARYTRINKEY_M0
adafruit_rotarytrinkey_m0.build.core=arduino
adafruit_rotarytrinkey_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_ROTARYTRINKEY_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_rotarytrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_rotarytrinkey_m0.build.openocdscript=openocd_scripts/rotarytrinkey_m0.cfg
adafruit_rotarytrinkey_m0.build.variant=rotarytrinkey_m0
adafruit_rotarytrinkey_m0.build.variant_system_lib=
adafruit_rotarytrinkey_m0.build.vid=0x239A
adafruit_rotarytrinkey_m0.build.pid=0x80FB
adafruit_rotarytrinkey_m0.bootloader.tool=openocd
adafruit_rotarytrinkey_m0.bootloader.file=rotarytrinkey_m0/bootloader-rotarytrinkey_m0.bin

# Menu
adafruit_rotarytrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_rotarytrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_rotarytrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_rotarytrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_rotarytrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_rotarytrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_rotarytrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_rotarytrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_rotarytrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_rotarytrinkey_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_rotarytrinkey_m0.menu.usbstack.arduino=Arduino
adafruit_rotarytrinkey_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_rotarytrinkey_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_rotarytrinkey_m0.menu.debug.off=Off
adafruit_rotarytrinkey_m0.menu.debug.on=On
adafruit_rotarytrinkey_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit NeoKey Trinkey M0 (SAMD21)
# -----------------------------------
adafruit_neokeytrinkey_m0.name=Adafruit NeoKey Trinkey M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_neokeytrinkey_m0.vid.0=0x239A
adafruit_neokeytrinkey_m0.pid.0=0x80FF
adafruit_neokeytrinkey_m0.vid.1=0x239A
adafruit_neokeytrinkey_m0.pid.1=0x00FF
adafruit_neokeytrinkey_m0.vid.2=0x239A
adafruit_neokeytrinkey_m0.pid.2=0x8100

# Upload
adafruit_neokeytrinkey_m0.upload.tool=bossac18
adafruit_neokeytrinkey_m0.upload.protocol=sam-ba
adafruit_neokeytrinkey_m0.upload.maximum_size=262144
adafruit_neokeytrinkey_m0.upload.offset=0x2000
adafruit_neokeytrinkey_m0.upload.use_1200bps_touch=true
adafruit_neokeytrinkey_m0.upload.wait_for_upload_port=true
adafruit_neokeytrinkey_m0.upload.native_usb=true

# Build
adafruit_neokeytrinkey_m0.build.mcu=cortex-m0plus
adafruit_neokeytrinkey_m0.build.f_cpu=48000000L
adafruit_neokeytrinkey_m0.build.usb_product="NeoKey Trinkey M0"
adafruit_neokeytrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_neokeytrinkey_m0.build.board=NEOKEYTRINKEY_M0
adafruit_neokeytrinkey_m0.build.core=arduino
adafruit_neokeytrinkey_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_NEOKEYTRINKEY_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_neokeytrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_neokeytrinkey_m0.build.openocdscript=openocd_scripts/neokeytrinkey_m0.cfg
adafruit_neokeytrinkey_m0.build.variant=neokeytrinkey_m0
adafruit_neokeytrinkey_m0.build.variant_system_lib=
adafruit_neokeytrinkey_m0.build.vid=0x239A
adafruit_neokeytrinkey_m0.build.pid=0x80FF
adafruit_neokeytrinkey_m0.bootloader.tool=openocd
adafruit_neokeytrinkey_m0.bootloader.file=neokeytrinkey_m0/bootloader-neokeytrinkey_m0.bin

# Menu
adafruit_neokeytrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_neokeytrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_neokeytrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_neokeytrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_neokeytrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_neokeytrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_neokeytrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_neokeytrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_neokeytrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_neokeytrinkey_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_neokeytrinkey_m0.menu.usbstack.arduino=Arduino
adafruit_neokeytrinkey_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_neokeytrinkey_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_neokeytrinkey_m0.menu.debug.off=Off
adafruit_neokeytrinkey_m0.menu.debug.on=On
adafruit_neokeytrinkey_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Slide Trinkey M0 (SAMD21)
# -----------------------------------
adafruit_slidetrinkey_m0.name=Adafruit Slide Trinkey M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_slidetrinkey_m0.vid.0=0x239A
adafruit_slidetrinkey_m0.pid.0=0x8101
adafruit_slidetrinkey_m0.vid.1=0x239A
adafruit_slidetrinkey_m0.pid.1=0x0101
adafruit_slidetrinkey_m0.vid.2=0x239A
adafruit_slidetrinkey_m0.pid.2=0x8102

# Upload
adafruit_slidetrinkey_m0.upload.tool=bossac18
adafruit_slidetrinkey_m0.upload.protocol=sam-ba
adafruit_slidetrinkey_m0.upload.maximum_size=262144
adafruit_slidetrinkey_m0.upload.offset=0x2000
adafruit_slidetrinkey_m0.upload.use_1200bps_touch=true
adafruit_slidetrinkey_m0.upload.wait_for_upload_port=true
adafruit_slidetrinkey_m0.upload.native_usb=true

# Build
adafruit_slidetrinkey_m0.build.mcu=cortex-m0plus
adafruit_slidetrinkey_m0.build.f_cpu=48000000L
adafruit_slidetrinkey_m0.build.usb_product="Slide Trinkey M0"
adafruit_slidetrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_slidetrinkey_m0.build.board=SLIDETRINKEY_M0
adafruit_slidetrinkey_m0.build.core=arduino
adafruit_slidetrinkey_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_SLIDETRINKEY_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_slidetrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_slidetrinkey_m0.build.openocdscript=openocd_scripts/slidetrinkey_m0.cfg
adafruit_slidetrinkey_m0.build.variant=slidetrinkey_m0
adafruit_slidetrinkey_m0.build.variant_system_lib=
adafruit_slidetrinkey_m0.build.vid=0x239A
adafruit_slidetrinkey_m0.build.pid=0x8101
adafruit_slidetrinkey_m0.bootloader.tool=openocd
adafruit_slidetrinkey_m0.bootloader.file=slidetrinkey_m0/bootloader-slidetrinkey_m0.bin

# Menu
adafruit_slidetrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_slidetrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_slidetrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_slidetrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_slidetrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_slidetrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_slidetrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_slidetrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_slidetrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_slidetrinkey_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_slidetrinkey_m0.menu.usbstack.arduino=Arduino
adafruit_slidetrinkey_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_slidetrinkey_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_slidetrinkey_m0.menu.debug.off=Off
adafruit_slidetrinkey_m0.menu.debug.on=On
adafruit_slidetrinkey_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit ProxLight Trinkey M0 (SAMD21)
# -----------------------------------
adafruit_proxlighttrinkey_m0.name=Adafruit ProxLight Trinkey M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_proxlighttrinkey_m0.vid.0=0x239A
adafruit_proxlighttrinkey_m0.pid.0=0x8103
adafruit_proxlighttrinkey_m0.vid.1=0x239A
adafruit_proxlighttrinkey_m0.pid.1=0x0103
adafruit_proxlighttrinkey_m0.vid.2=0x239A
adafruit_proxlighttrinkey_m0.pid.2=0x8104

# Upload
adafruit_proxlighttrinkey_m0.upload.tool=bossac18
adafruit_proxlighttrinkey_m0.upload.protocol=sam-ba
adafruit_proxlighttrinkey_m0.upload.maximum_size=262144
adafruit_proxlighttrinkey_m0.upload.offset=0x2000
adafruit_proxlighttrinkey_m0.upload.use_1200bps_touch=true
adafruit_proxlighttrinkey_m0.upload.wait_for_upload_port=true
adafruit_proxlighttrinkey_m0.upload.native_usb=true

