M0LTE/pi-transceiver/electronics/PA_Board_V2/Arduino/Board/boards.txt
# Build
adafruit_proxlighttrinkey_m0.build.mcu=cortex-m0plus
adafruit_proxlighttrinkey_m0.build.f_cpu=48000000L
adafruit_proxlighttrinkey_m0.build.usb_product="ProxLight Trinkey M0"
adafruit_proxlighttrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_proxlighttrinkey_m0.build.board=PROXLIGHTTRINKEY_M0
adafruit_proxlighttrinkey_m0.build.core=arduino
adafruit_proxlighttrinkey_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_PROXLIGHTTRINKEY_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_proxlighttrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_proxlighttrinkey_m0.build.openocdscript=openocd_scripts/proxlighttrinkey_m0.cfg
adafruit_proxlighttrinkey_m0.build.variant=proxlighttrinkey_m0
adafruit_proxlighttrinkey_m0.build.variant_system_lib=
adafruit_proxlighttrinkey_m0.build.vid=0x239A
adafruit_proxlighttrinkey_m0.build.pid=0x8103
adafruit_proxlighttrinkey_m0.bootloader.tool=openocd
adafruit_proxlighttrinkey_m0.bootloader.file=proxlighttrinkey_m0/bootloader-proxlighttrinkey_m0.bin

# Menu
adafruit_proxlighttrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_proxlighttrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_proxlighttrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_proxlighttrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_proxlighttrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_proxlighttrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_proxlighttrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_proxlighttrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_proxlighttrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_proxlighttrinkey_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_proxlighttrinkey_m0.menu.usbstack.arduino=Arduino
adafruit_proxlighttrinkey_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_proxlighttrinkey_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_proxlighttrinkey_m0.menu.debug.off=Off
adafruit_proxlighttrinkey_m0.menu.debug.on=On
adafruit_proxlighttrinkey_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit ItsyBitsy M0 Express (SAMD21)
# -----------------------------------
adafruit_itsybitsy_m0.name=Adafruit ItsyBitsy M0 Express (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_itsybitsy_m0.vid.0=0x239A
adafruit_itsybitsy_m0.pid.0=0x800F
adafruit_itsybitsy_m0.vid.1=0x239A
adafruit_itsybitsy_m0.pid.1=0x000F
adafruit_itsybitsy_m0.vid.2=0x239A
adafruit_itsybitsy_m0.pid.2=0x8012

# Upload
adafruit_itsybitsy_m0.upload.tool=bossac18
adafruit_itsybitsy_m0.upload.protocol=sam-ba
adafruit_itsybitsy_m0.upload.maximum_size=262144
adafruit_itsybitsy_m0.upload.offset=0x2000
adafruit_itsybitsy_m0.upload.use_1200bps_touch=true
adafruit_itsybitsy_m0.upload.wait_for_upload_port=true
adafruit_itsybitsy_m0.upload.native_usb=true

# Build
adafruit_itsybitsy_m0.build.mcu=cortex-m0plus
adafruit_itsybitsy_m0.build.f_cpu=48000000L
adafruit_itsybitsy_m0.build.usb_product="ItsyBitsy M0 Express"
adafruit_itsybitsy_m0.build.usb_manufacturer="Adafruit"
adafruit_itsybitsy_m0.build.board=ITSYBITSY_M0
adafruit_itsybitsy_m0.build.core=arduino
adafruit_itsybitsy_m0.build.extra_flags=-D__SAMD21G18A__ -DCRYSTALLESS -DADAFRUIT_ITSYBITSY_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_itsybitsy_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_itsybitsy_m0.build.openocdscript=openocd_scripts/itsybitsy_m0.cfg
adafruit_itsybitsy_m0.build.variant=itsybitsy_m0
adafruit_itsybitsy_m0.build.variant_system_lib=
adafruit_itsybitsy_m0.build.vid=0x239A
adafruit_itsybitsy_m0.build.pid=0x800F
adafruit_itsybitsy_m0.bootloader.tool=openocd
adafruit_itsybitsy_m0.bootloader.file=itsybitsyM0/bootloader-itsybitsy_m0-v2.0.0-adafruit.5.bin

# Menu
adafruit_itsybitsy_m0.menu.opt.small=Small (-Os) (standard)
adafruit_itsybitsy_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_itsybitsy_m0.menu.opt.fast=Fast (-O2)
adafruit_itsybitsy_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_itsybitsy_m0.menu.opt.faster=Faster (-O3)
adafruit_itsybitsy_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_itsybitsy_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_itsybitsy_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_itsybitsy_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_itsybitsy_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_itsybitsy_m0.menu.usbstack.arduino=Arduino
adafruit_itsybitsy_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_itsybitsy_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_itsybitsy_m0.menu.debug.off=Off
adafruit_itsybitsy_m0.menu.debug.on=On
adafruit_itsybitsy_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit pIRKey (SAMD21)
# -----------------------------------
adafruit_pirkey.name=Adafruit pIRKey (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_pirkey.vid.0=0x239A
adafruit_pirkey.pid.0=0x801E
adafruit_pirkey.vid.1=0x239A
adafruit_pirkey.pid.1=0x001E

# Upload
adafruit_pirkey.upload.tool=bossac18
adafruit_pirkey.upload.protocol=sam-ba
adafruit_pirkey.upload.maximum_size=262144
adafruit_pirkey.upload.offset=0x2000
adafruit_pirkey.upload.use_1200bps_touch=true
adafruit_pirkey.upload.wait_for_upload_port=true
adafruit_pirkey.upload.native_usb=true

# Build
adafruit_pirkey.build.mcu=cortex-m0plus
adafruit_pirkey.build.f_cpu=48000000L
adafruit_pirkey.build.usb_product="pIRKey"
adafruit_pirkey.build.usb_manufacturer="Adafruit"
adafruit_pirkey.build.board=PIRKEY
adafruit_pirkey.build.core=arduino
adafruit_pirkey.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_PIRKEY -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_pirkey.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_pirkey.build.openocdscript=openocd_scripts/pirkey.cfg
adafruit_pirkey.build.variant=pirkey
adafruit_pirkey.build.variant_system_lib=
adafruit_pirkey.build.vid=0x239A
adafruit_pirkey.build.pid=0x801E
adafruit_pirkey.bootloader.tool=openocd
adafruit_pirkey.bootloader.file=pirkey/bootloader-pirkey-v2.0.0-adafruit.5.bin

# Menu
adafruit_pirkey.menu.opt.small=Small (-Os) (standard)
adafruit_pirkey.menu.opt.small.build.flags.optimize=-Os
adafruit_pirkey.menu.opt.fast=Fast (-O2)
adafruit_pirkey.menu.opt.fast.build.flags.optimize=-O2
adafruit_pirkey.menu.opt.faster=Faster (-O3)
adafruit_pirkey.menu.opt.faster.build.flags.optimize=-O3
adafruit_pirkey.menu.opt.fastest=Fastest (-Ofast)
adafruit_pirkey.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_pirkey.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_pirkey.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_pirkey.menu.usbstack.arduino=Arduino
adafruit_pirkey.menu.usbstack.tinyusb=TinyUSB
adafruit_pirkey.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_pirkey.menu.debug.off=Off
adafruit_pirkey.menu.debug.on=On
adafruit_pirkey.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Hallowing M0 (SAMD21)
# -----------------------------------
adafruit_hallowing.name=Adafruit Hallowing M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_hallowing.vid.0=0x239A
adafruit_hallowing.pid.0=0xDEAD
adafruit_hallowing.vid.1=0x239A
adafruit_hallowing.pid.1=0xD1ED
adafruit_hallowing.vid.2=0x239A
adafruit_hallowing.pid.2=0xB000

# Upload
adafruit_hallowing.upload.tool=bossac18
adafruit_hallowing.upload.protocol=sam-ba
adafruit_hallowing.upload.maximum_size=262144
adafruit_hallowing.upload.offset=0x2000
adafruit_hallowing.upload.use_1200bps_touch=true
adafruit_hallowing.upload.wait_for_upload_port=true
adafruit_hallowing.upload.native_usb=true

# Build
adafruit_hallowing.build.mcu=cortex-m0plus
adafruit_hallowing.build.f_cpu=48000000L
adafruit_hallowing.build.usb_product="Hallowing M0"
adafruit_hallowing.build.usb_manufacturer="Adafruit"
adafruit_hallowing.build.board=SAMD_HALLOWING
adafruit_hallowing.build.core=arduino
adafruit_hallowing.build.extra_flags=-D__SAMD21G18A__ -DCRYSTALLESS -DARDUINO_SAMD_HALLOWING_M0 -DADAFRUIT_HALLOWING -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_hallowing.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_hallowing.build.openocdscript=openocd_scripts/hallowing_m0_express.cfg
adafruit_hallowing.build.variant=hallowing_m0_express
adafruit_hallowing.build.variant_system_lib=
adafruit_hallowing.build.vid=0x239A
adafruit_hallowing.build.pid=0xDEAD
adafruit_hallowing.bootloader.tool=openocd
adafruit_hallowing.bootloader.file=hallowingM0/bootloader-hallowing_m0-v2.0.0-adafruit.0-21-g887cc30.bin

# Menu
adafruit_hallowing.menu.opt.small=Small (-Os) (standard)
adafruit_hallowing.menu.opt.small.build.flags.optimize=-Os
adafruit_hallowing.menu.opt.fast=Fast (-O2)
adafruit_hallowing.menu.opt.fast.build.flags.optimize=-O2
adafruit_hallowing.menu.opt.faster=Faster (-O3)
adafruit_hallowing.menu.opt.faster.build.flags.optimize=-O3
adafruit_hallowing.menu.opt.fastest=Fastest (-Ofast)
adafruit_hallowing.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_hallowing.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_hallowing.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_hallowing.menu.usbstack.arduino=Arduino
adafruit_hallowing.menu.usbstack.tinyusb=TinyUSB
adafruit_hallowing.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_hallowing.menu.debug.off=Off
adafruit_hallowing.menu.debug.on=On
adafruit_hallowing.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Crickit M0 (SAMD21)
# -----------------------------------
adafruit_crickit_m0.name=Adafruit Crickit M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_crickit_m0.vid.0=0x239A
adafruit_crickit_m0.pid.0=0x802D
adafruit_crickit_m0.vid.1=0x239A
adafruit_crickit_m0.pid.1=0x002D
adafruit_crickit_m0.vid.2=0x239A
adafruit_crickit_m0.pid.2=0x802D

# Upload
adafruit_crickit_m0.upload.tool=bossac18
adafruit_crickit_m0.upload.protocol=sam-ba
adafruit_crickit_m0.upload.maximum_size=262144
adafruit_crickit_m0.upload.offset=0x2000
adafruit_crickit_m0.upload.use_1200bps_touch=true
adafruit_crickit_m0.upload.wait_for_upload_port=true
adafruit_crickit_m0.upload.native_usb=true

# Build
adafruit_crickit_m0.build.mcu=cortex-m0plus
adafruit_crickit_m0.build.f_cpu=48000000L
adafruit_crickit_m0.build.usb_product="Crickit M0"
adafruit_crickit_m0.build.usb_manufacturer="Adafruit"
adafruit_crickit_m0.build.board=CRICKIT_M0
adafruit_crickit_m0.build.core=arduino
adafruit_crickit_m0.build.extra_flags=-D__SAMD21G18A__ -DCRYSTALLESS -DADAFRUIT_CRICKIT_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_crickit_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_crickit_m0.build.openocdscript=openocd_scripts/crickit_m0.cfg
adafruit_crickit_m0.build.variant=crickit_m0
adafruit_crickit_m0.build.variant_system_lib=
adafruit_crickit_m0.build.vid=0x239A
adafruit_crickit_m0.build.pid=0x802D
adafruit_crickit_m0.bootloader.tool=openocd
adafruit_crickit_m0.bootloader.file=crickit/samd21_sam_ba.bin

# Menu
adafruit_crickit_m0.menu.opt.small=Small (-Os) (standard)
adafruit_crickit_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_crickit_m0.menu.opt.fast=Fast (-O2)
adafruit_crickit_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_crickit_m0.menu.opt.faster=Faster (-O3)
adafruit_crickit_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_crickit_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_crickit_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_crickit_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_crickit_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_crickit_m0.menu.usbstack.arduino=Arduino
adafruit_crickit_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_crickit_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_crickit_m0.menu.debug.off=Off
adafruit_crickit_m0.menu.debug.on=On
adafruit_crickit_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit BLM Badge (SAMD21)
# -----------------------------------
adafruit_blm_badge.name=Adafruit BLM Badge (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_blm_badge.vid.0=0x239A
adafruit_blm_badge.pid.0=0x80BF
adafruit_blm_badge.vid.1=0x239A
adafruit_blm_badge.pid.1=0x00BF
adafruit_blm_badge.vid.2=0x239A
adafruit_blm_badge.pid.2=0x80C0

# Upload
adafruit_blm_badge.upload.tool=bossac18
adafruit_blm_badge.upload.protocol=sam-ba
adafruit_blm_badge.upload.maximum_size=262144
adafruit_blm_badge.upload.offset=0x2000
adafruit_blm_badge.upload.use_1200bps_touch=true
adafruit_blm_badge.upload.wait_for_upload_port=true
adafruit_blm_badge.upload.native_usb=true

# Build
adafruit_blm_badge.build.mcu=cortex-m0plus
adafruit_blm_badge.build.f_cpu=48000000L
adafruit_blm_badge.build.usb_product="BLM Badge"
adafruit_blm_badge.build.usb_manufacturer="Adafruit"
adafruit_blm_badge.build.board=BLM_BADGE_M0
adafruit_blm_badge.build.core=arduino
adafruit_blm_badge.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS  -DADAFRUIT_BLM_BADGE -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_blm_badge.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_blm_badge.build.openocdscript=openocd_scripts/blm_badge.cfg
adafruit_blm_badge.build.variant=blm_badge
adafruit_blm_badge.build.variant_system_lib=
adafruit_blm_badge.build.vid=0x239A
adafruit_blm_badge.build.pid=0x80BF
adafruit_blm_badge.bootloader.tool=openocd
adafruit_blm_badge.bootloader.file=blmbadge/bootloader-blm_badge.bin

# Menu
adafruit_blm_badge.menu.opt.small=Small (-Os) (standard)
adafruit_blm_badge.menu.opt.small.build.flags.optimize=-Os
adafruit_blm_badge.menu.opt.fast=Fast (-O2)
adafruit_blm_badge.menu.opt.fast.build.flags.optimize=-O2
adafruit_blm_badge.menu.opt.faster=Faster (-O3)
adafruit_blm_badge.menu.opt.faster.build.flags.optimize=-O3
adafruit_blm_badge.menu.opt.fastest=Fastest (-Ofast)
adafruit_blm_badge.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_blm_badge.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_blm_badge.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
adafruit_blm_badge.menu.usbstack.arduino=Arduino
adafruit_blm_badge.menu.usbstack.tinyusb=TinyUSB
adafruit_blm_badge.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
adafruit_blm_badge.menu.debug.off=Off
adafruit_blm_badge.menu.debug.on=On
adafruit_blm_badge.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Metro M4 (SAMD51)
# -----------------------------------
adafruit_metro_m4.name=Adafruit Metro M4 (SAMD51)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_metro_m4.vid.0=0x239A
adafruit_metro_m4.pid.0=0x8020
adafruit_metro_m4.vid.1=0x239A
adafruit_metro_m4.pid.1=0x0020
adafruit_metro_m4.vid.2=0x239A
adafruit_metro_m4.pid.2=0x8021
adafruit_metro_m4.vid.3=0x239A
adafruit_metro_m4.pid.3=0x0021

# Upload
adafruit_metro_m4.upload.tool=bossac18
adafruit_metro_m4.upload.protocol=sam-ba
adafruit_metro_m4.upload.maximum_size=507904
adafruit_metro_m4.upload.offset=0x4000
adafruit_metro_m4.upload.use_1200bps_touch=true
adafruit_metro_m4.upload.wait_for_upload_port=true
adafruit_metro_m4.upload.native_usb=true

# Build
adafruit_metro_m4.build.mcu=cortex-m4
adafruit_metro_m4.build.f_cpu=120000000L
adafruit_metro_m4.build.usb_product="Metro M4"
adafruit_metro_m4.build.usb_manufacturer="Adafruit"
adafruit_metro_m4.build.board=METRO_M4
adafruit_metro_m4.build.core=arduino
adafruit_metro_m4.build.extra_flags=-D__SAMD51J19A__ -DADAFRUIT_METRO_M4_EXPRESS -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
adafruit_metro_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_metro_m4.build.openocdscript=openocd_scripts/metro_m4.cfg
adafruit_metro_m4.build.variant=metro_m4
adafruit_metro_m4.build.variant_system_lib=
adafruit_metro_m4.build.vid=0x239A
adafruit_metro_m4.build.pid=0x8020
adafruit_metro_m4.bootloader.tool=openocd
adafruit_metro_m4.bootloader.file=metroM4/bootloader-metro_m4-v2.0.0-adafruit.5.bin
adafruit_metro_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

